app/Controllers/Register.php

    public function index()
    {
        $rules = [
            'email' => ['rules' => 'required|min_length[4]|max_length[255]|valid_email|is_unique[users.email]'],
            'password' => ['rules' => 'required|min_length[8]|max_length[255]'],
            'confirm_password' => ['label' => 'confirm password', 'rules' => 'matches[password]'],
        ];

        if ($this->validate($rules)) {
            $model = new UserModel();
            $data = [
                'email' => $this->request->getVar('email'),
                'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            ];
            $model->save($data);
---
INSERT INTO `users` (`email`, `password`, `created_at`, `updated_at`) VALUES ('admin2@gmail.com', '$2y$10$sANoLkL8G37D0s9qedEEM.yETqTbC8WCq6mp6gWmBIhXmULML8vni', '2023-01-31 10:51:25', '2023-01-31 10:51:25')